{"sections":{"main":{"type":"main-page","settings":{"padding_top":28,"padding_bottom":28}},"collapsible_content_TCLw6r":{"type":"collapsible-content","blocks":{"collapsible_row_XnC3HG":{"type":"collapsible_row","settings":{"heading":"I need long curtain rods, will they sag?","icon":"none","row_content":"<p>Good question, probably the most asked. It depends on how much the curtains weigh and how long the rods are. Calculated weight limit are not available but the rods are very strong and unless your curtains are abnormally heavy (over 8’ long or super plush) the guidelines on the website will work for most curtains. If you are concerned about the weight, adding an additional mount to the rod for extra support is recommended. We understand that it is most convenient to set up your rods without additional mounting brackets which can interfere with the curtain draw, but proper support is very important, so we carry a full range of solutions including c-rings and bypass hardware for almost every situation. Your challenging applications, our specialty.<\/p>","page":""}},"collapsible_row_AAtwip":{"type":"collapsible_row","settings":{"heading":"How long should the curtain rod be?","icon":"none","row_content":"<p>To determine the rod length, you will want to add the width of the stack to the width of the windows. The stack will be determined by how close to the window you want the curtains to hang and the width and weight of the fabric. Your drapery provider should be able to advise you on this.  I commonly see 5”-10” added to each side of the window to accommodate for the stack or 15% stack for each curtain panel (Example: 50” curtain panel needs 7” for stacking).<\/p>","page":""}},"collapsible_row_MDdrBT":{"type":"collapsible_row","settings":{"heading":"How many support mounts do I need?","icon":"none","row_content":"<p>The mounts needed will be determined by the length and diameter of the rod selected. All rods come with a support mount for each end.<\/p><p>7\/8″ rods over 72″ long will require one center support mount , over 144″ requires two, over 215″ requires three and so on.<\/p><p>1-1\/4″ rods over 93″ long will require one center support mount, over 186″ requires two, over 278″ requires three and so on.<\/p>","page":""}},"collapsible_row_NRyNQj":{"type":"collapsible_row","settings":{"heading":"I want a rod with end mounts or end caps, how do I order it, and how much is it?","icon":"none","row_content":"<p>No problem, you can price and order that with just a few clicks, please see our new <a href=\"\/blogs\/information\" title=\"Information\"><strong>How to measure your windows for curtain rods <\/strong><\/a>and <a href=\"\/products\/standard-iron-curtain-rod\" title=\"Standard Iron Curtain Rod\"><strong>Curtain Rod Quick Quote <\/strong><\/a>pages.<\/p>","page":""}},"collapsible_row_Rj6yJ7":{"type":"collapsible_row","settings":{"heading":"Do you make double rods?","icon":"none","row_content":"<p>Yes, please see our new <a href=\"https:\/\/www.ironhardware.com\/how-to-measure-windows-for-double-drapery-rods\/\"><strong>How to measure for Double Curtain Rods <\/strong><\/a>and <a href=\"https:\/\/www.ironhardware.com\/product\/double-iron-curtain-rod\/\"><strong>Double Rod Quick Quote<\/strong><\/a> pages to price and buy double rods with just a few clicks.<\/p>","page":""}},"collapsible_row_6GmiKB":{"type":"collapsible_row","settings":{"heading":"My windows are close to the corner, do you make corner rods?","icon":"none","row_content":"<p>Yes, please see our new <a href=\"https:\/\/www.ironhardware.com\/how-to-measure-corner-windows-for-drapery-rod\/\"><strong>How to measure Corner Windows for Curtain Rods <\/strong><\/a>and <a href=\"https:\/\/www.ironhardware.com\/product\/corner-iron-curtain-rod\/\"><strong>Corner Rod Quick Quote <\/strong><\/a>page to price and buy corner curtain rods. <\/p>","page":""}},"collapsible_row_DtwtG7":{"type":"collapsible_row","settings":{"heading":"I am not sure I got my order correct or complete, should I submit it?","icon":"none","row_content":"<p>Schedule a free <strong>design consultation <\/strong>for further guidance.<\/p><p>If you note any questions, special instructions, or additions in the comment section at checkout, it will allow us to input your data and email you back a copy for editing. When you post a question in the special instructions field, we will allow you to confirm your order prior to cutting your rods.<\/p><p><strong>Order changes on custom curtain rods can be made within 24 hours of placing the order.<\/strong> Since all curtain rods are custom cut to your measurements, we can not make changes after the 24 hours.<\/p><p><strong>Order changes cannot be made on Expedited orders. <\/strong>Expedited orders go into production immediately and cannot be altered.<\/p>","page":""}},"collapsible_row_AHqLYr":{"type":"collapsible_row","settings":{"heading":"How many rings do I need?","icon":"none","row_content":"<p>For flat panels, most designers use one ring spaced every four inches of curtain fabric. This provides a nice finished look. Measure the curtain width and divide by four. For pleated drapes, count the pleats and add one ring for each end. If you are having your drapes custom made with pleats, ask your seamstress how many rings you will need.<\/p>","page":""}},"collapsible_row_PRQNne":{"type":"collapsible_row","settings":{"heading":"You sell eyelet rings and rings with clips, what is the difference?","icon":"none","row_content":"<p>Eyelet rings are designed to be sewn on or used with standard drapery pins. These are by far the most popular with designers as they hold more securely and give you a more finished look. Rings with clips are good for very light or temporary drapes that get changed often, like shower curtains.<\/p><p>Rings will give you the classic iron look that will stand the test of time as many fashion trends like grommets come and go. You will save money and find a much larger selection of drapes available for use with rings.<\/p>","page":""}},"collapsible_row_UFrycD":{"type":"collapsible_row","settings":{"heading":"Where can I purchase good quality Draperies?","icon":"none","row_content":"<p>We’ve had great results with the products and services of village drapes at www.villagedrapes.com<\/p>","page":""}},"collapsible_row_kEgTLe":{"type":"collapsible_row","settings":{"heading":"My drapes have grommets, will your rods work with grommets?","icon":"none","row_content":"<p>Yes,  most grommets are 1 1\/2″ or larger, and will work great with our 1 1\/4″ rods or our 7\/8″ rods. Keep in mind that low quality, thin, light, or sharp grommets can scar your curtain rods and are not recommended by any manufacturer. Select only heavy, smooth, high quality grommets, and remember that grommets make it more difficult to launder drapes and will need replacement with any curtain change.<\/p><p>A major issue with the grommet fashion trend is that on a long span or one way draw, they leave you no way to bypass the brackets, and will not work with any rod in this case. Rings can be used with bypass hardware to allow your drapes to slide where you want them, and will last forever as draperies come and go. <\/p>","page":""}},"collapsible_row_iywxGD":{"type":"collapsible_row","settings":{"heading":"What is your turn around time? ","icon":"none","row_content":"<p>Very quick! We try to stock every item shown on the web site and ship most curtain rod orders within 14-20 business days. Custom made parts and custom plate cutting like t-straps and hinges may take a few weeks. Curtain rings and miscellaneous hardware typically ships with-in 2-3 days of purchase.<\/p><p>Expedited orders will ship within 1-10 days.<\/p>","page":""}},"collapsible_row_bH6rfJ":{"type":"collapsible_row","settings":{"heading":"How much is shipping?","icon":"none","row_content":"<p>We only charge $35.00 for one curtain rod, and $15.00 for each additional curtain rod shipped anywhere in the lower 48 states. Shipping costs for custom orders and hardware are quoted based on weight, size and location.<\/p>","page":""}},"collapsible_row_x69LrN":{"type":"collapsible_row","settings":{"heading":"Do you ship to Canada? ","icon":"none","row_content":"<p>We are happy to ship orders to Canada, however, please note that all taxes and duties must be paid by the customer at time of delivery to the shipping agent.<\/p>","page":""}},"collapsible_row_hewnHt":{"type":"collapsible_row","settings":{"heading":"What is the longest curtain rod you can ship?","icon":"none","row_content":"<p>The maximum length we can ship curtain rods in one piece is 93″ however, we will generally split curtain rods at the mounting points if over 72″ when center supports are necessary. We have developed a system that is invisible, strong, easy to assemble, and will allow you to build a high-quality curtain rod without concern of sagging or poor performance.<\/p>","page":""}},"collapsible_row_eBLrqz":{"type":"collapsible_row","settings":{"heading":"Can I pick up my order? ","icon":"none","row_content":"<p>At this time, we do not offer will call for local orders.<\/p>","page":""}},"collapsible_row_3QbYzD":{"type":"collapsible_row","settings":{"heading":"Are joined curtain rods strong?  ","icon":"none","row_content":"<p>Rest assured, we can easily guarantee that any of our joined curtain rods will be as strong and functional as a one piece curtain rod.<\/p>","page":""}},"collapsible_row_9W9wnG":{"type":"collapsible_row","settings":{"heading":"Do you sell Telescopic rods?","icon":"none","row_content":"<p>No, telescopic rods are made from very light gauge steel and we do not sell them. Our rods are high tensile strength one piece rods. When our rods are split for shipping, it is done so at a mounting point and joined together internally so there is never a bump for your curtains to hang up on.<\/p>","page":""}},"collapsible_row_NQXHeW":{"type":"collapsible_row","settings":{"heading":"I did not receive tracking info, can I call to check on the status of my order?","icon":"none","row_content":"<p>Yes, we understand that you are excited about receiving your hardware and welcome your calls. Although as your shipment leaves our warehouse, tracking info will automatically be sent to the email address that you listed on your order form. These notices may be viewed as junk by some email servers so if you will please check your bulk mail and junk mail before calling, it will free us up to process your order more quickly.<\/p>","page":""}},"collapsible_row_KAdnJ6":{"type":"collapsible_row","settings":{"heading":"What are your rods made of?","icon":"none","row_content":"<p>The 7\/8” and 1 ¼” are made from 16 gage steel tubing. Using steel tubing allows us the ability to make longer length rods, plus solid iron rod is extremely heavy!<\/p><p>The café rods, mounts, finials, and rings are all made from solid iron.<\/p><p>Since neither metal is not naturally black, all the parts are powder coated to create a uniform and consistent product.<\/p>","page":""}},"collapsible_row_awYnaY":{"type":"collapsible_row","settings":{"heading":"Iron vs. Steel – What is the difference?","icon":"none","row_content":"<p>The difference between iron and steel is simply that iron is an element and steel, is an alloy of iron and carbon. Some may believe that “wrought iron” is, in some manner, also referring to steel since “wrought” means forged.<\/p><p>Iron is a pure element and Steel is an alloy where Iron is the main component.<\/p><p>Iron gets oxidized easily to form rust, the alloying elements in Steel protects it from getting rusted.<\/p>","page":""}},"collapsible_row_EYPhJM":{"type":"collapsible_row","settings":{"heading":"What is the return policy? ","icon":"none","row_content":"<p>Store credit on stock items returned in new condition within 30 days of purchase. Customer is responsible for shipping charges. Return authorization number is required and can be obtained by contact us by email at Orders@ironhardware.com.<\/p><p>Custom items, such as curtain rods, are not eligible for return, exchange or refund.<br\/>No returns on used or custom items. Restocking fees may apply.<\/p>","page":""}},"collapsible_row_bRqNCf":{"type":"collapsible_row","settings":{"heading":"Do you offer a Trade Program?","icon":"none","row_content":"<p>We offer a 10% trade discount off our website prices. We will need a copy of your Seller’s Permit or Resale Certificate, and website or any social media accounts that can be used to verify your trade. Once received,  we will supply you with a coupon code to be used at check out.<\/p><p>Sales tax will only be applied to orders shipping within the state of California.<\/p><p>We offer exclusive coupon code discount for Architectural Firms, Interior Designers\/ Studios, Real Estate: Design & Staging, Commercial Designers and Drapery Workrooms.<\/p><p><a href=\"\/pages\/trade-account\" title=\"Trade Program\">Apply now for the Trade Program<\/a><\/p>","page":""}},"collapsible_row_hYphnC":{"type":"collapsible_row","settings":{"heading":"Are your products good for humid locations?","icon":"none","row_content":"<p>Although I can’t guarantee that the iron won’t rust over time simply due to the nature of the material, I can tell you that these rods are often used in bathrooms and even outdoors without complaint. All rods are powder coated which helps support the longevity of the hardware.<\/p>","page":""}},"collapsible_row_CfgEY9":{"type":"collapsible_row","settings":{"heading":"How can I order a rod with a French return on one side only?","icon":"none","row_content":"<p>When you place your order, use the “Special Instructions” box to tell us which side needs an end mount and which side needs a 90-degree return.<\/p>","page":""}},"collapsible_row_ztrhhp":{"type":"collapsible_row","settings":{"heading":"Do you have terms for the promo codes you offer?","icon":"none","row_content":"<p>Yes, discount codes can’t be combined, applied with trade account pricing, or applied after an order has already been placed.<\/p>","page":""}}},"block_order":["collapsible_row_XnC3HG","collapsible_row_AAtwip","collapsible_row_MDdrBT","collapsible_row_NRyNQj","collapsible_row_Rj6yJ7","collapsible_row_6GmiKB","collapsible_row_DtwtG7","collapsible_row_AHqLYr","collapsible_row_PRQNne","collapsible_row_UFrycD","collapsible_row_kEgTLe","collapsible_row_iywxGD","collapsible_row_bH6rfJ","collapsible_row_x69LrN","collapsible_row_hewnHt","collapsible_row_eBLrqz","collapsible_row_3QbYzD","collapsible_row_9W9wnG","collapsible_row_NQXHeW","collapsible_row_KAdnJ6","collapsible_row_awYnaY","collapsible_row_EYPhJM","collapsible_row_bRqNCf","collapsible_row_hYphnC","collapsible_row_CfgEY9","collapsible_row_ztrhhp"],"settings":{"caption":"","heading":"","heading_size":"h1","heading_alignment":"center","layout":"none","color_scheme":"","container_color_scheme":"","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}}},"order":["main","collapsible_content_TCLw6r"]}